Revit 2024 API
ParameterTypeId.RenderPlantName Property
 "Plant Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RenderPlantName { get; }
Visual Basic
Public Shared ReadOnly Property RenderPlantName As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RenderPlantName {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace